; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 blue_block_1 purple_block_1 orange_block_1 purple_block_2 yellow_block_1 blue_block_2 - block
 )
 (:init (ontable green_block_1) (ontable blue_block_1) (ontable purple_block_1) (on orange_block_1 green_block_1) (on purple_block_2 purple_block_1) (on yellow_block_1 blue_block_1) (ontable blue_block_2) (clear orange_block_1) (clear purple_block_2) (clear yellow_block_1) (clear blue_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on purple_block_1 yellow_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_2 purple_block_1)
   deleted: (on purple_block_2 purple_block_1) (clear purple_block_2) (handempty)
   added: (holding purple_block_2) (clear purple_block_1)
   goals met: 0 of 1
2. (putdown purple_block_2)
   deleted: (holding purple_block_2)
   added: (clear purple_block_2) (handempty) (ontable purple_block_2)
   goals met: 0 of 1
3. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1)
   goals met: 0 of 1
4. (stack purple_block_1 yellow_block_1)
   deleted: (clear yellow_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 yellow_block_1)
   goals met: 1 of 1
